       IDENTIFICATION DIVISION.
       PROGRAM-ID. EXERCOB01.
      ***********************************
      * AREA DE COMENTARIOS - REMARKS
      * AUTHOR = FELIPE TADEU
      * OBJETIVO: RECEBER NOME E FORMATAR A SAÍDA DE UM CPF
      * IMPRIMIR FORMATADO - USO DE PONTO E DA MASCARA
      * CADASTRO DE PESSOA FÍSICA
      * DATA = 01/02/2022
      ***********************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77  WRK-NOME PIC X(20) VALUE SPACES.
       77  WRK-CPF PIC X(11) VALUE ZEROS.
       77  WRK-CPF-ED PIC ZZZ.ZZZ.ZZ9/99.
       01  WRK-DATA.
           02 WRK-ANO PIC 9(04) VALUE ZEROS.
           02 WRK-MES PIC 9(02) VALUE ZEROS.
           02 WRK-DIA PIC 9(02) VALUE ZEROS.
       77  WRK-SALARIO PIC 9(06)V99 VALUE ZEROS.
       77  WRK-SALARIO-ED PIC $ZZZ.ZZ9,99 VALUE ZEROS.
       PROCEDURE DIVISION.
      ***********RECEBENDO DADOS*********
           DISPLAY 'CADASTRO DE FUNCIONARIOS'
           DISPLAY 'INFORME O NOME:'.
           ACCEPT WRK-NOME FROM CONSOLE.
           DISPLAY 'INFORME O CPF:'
           ACCEPT WRK-CPF FROM CONSOLE.
           MOVE WRK-CPF TO WRK-CPF-ED.
           ACCEPT WRK-DATA FROM DATE YYYYMMDD.
           DISPLAY 'INFORME O SALARIO:'
           ACCEPT WRK-SALARIO FROM CONSOLE.
           MOVE WRK-SALARIO TO WRK-SALARIO-ED.
      ***********IMPRIMINDO DADOS********
           DISPLAY 'CADASTRO DE FUNCIONARIO'.
           DISPLAY 'NOME: ' WRK-NOME.
           DISPLAY 'CPF: ' WRK-CPF-ED.
           DISPLAY 'DATA DE CADASTRO: 'WRK-DIA '/' WRK-MES '/' WRK-ANO
           DISPLAY 'SALARIO: R' WRK-SALARIO-ED.
           STOP RUN.
