       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB05.
      ***************************************
      * AREA DE COMENTARIOS - REMARKS
      * AUTHOR = FELIPE TADEU
      * OBJETIVO: OPERADORES ARTIMETICOS
      * DATA  = 02/02/2022
      ***************************************
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77  WRK-NUM1  PIC 9(02) VALUE ZEROS.
       77  WRK-NUM2  PIC 9(02) VALUE ZEROS.
       77  WRK-RESUL PIC 9(04) VALUE ZEROS.
       77  WRK-RESTO PIC 9(02) VALUES ZEROS.
       PROCEDURE DIVISION.
           ACCEPT WRK-NUM1 FROM CONSOLE.
           ACCEPT WRK-NUM2 FROM CONSOLE.
           DISPLAY '======================'
           DISPLAY 'NUMERO1.. ' WRK-NUM1.
           DISPLAY 'NUMERO2.. ' WRK-NUM2.
      *************SOMA
           ADD WRK-NUM1 WRK-NUM2 TO WRK-RESUL.
           DISPLAY 'O RESULTADO DA SOMA E: ' WRK-RESUL.
      *************SUBTRACAO
           SUBTRACT WRK-NUM1 FROM WRK-NUM2 GIVING WRK-RESUL.
           DISPLAY 'O RESULTADO DA SUBTRACAO E: ' WRK-RESUL.
      *************DIVISAO
           DIVIDE WRK-NUM1 BY WRK-NUM2 GIVING WRK-RESUL
               REMAINDER WRK-RESTO.
           DISPLAY 'O RESULTADO DA DIVISAO E:' WRK-RESUL.
           DISPLAY 'O RESTO DA DIVIDAO E:' WRK-RESTO.
      *************MULTIPLICAÇÃO
           MULTIPLY WRK-NUM1 BY WRK-NUM2 GIVING WRK-RESUL.
           DISPLAY 'O RESULTADO DA MULTIPLICACAO E:' WRK-RESUL.
      *************COMPUTE - MEDIA OU QUANDO TIVER UMA EXPRESSAO
           COMPUTE WRK-RESUL = (WRK-NUM1+ WRK-NUM2) / 2.
           DISPLAY 'A MEDIA E: ' WRK-RESUL.
           STOP RUN.
