       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB06.
      ***************************************
      * AREA DE COMENTARIOS - REMARKS
      * AUTHOR = FELIPE TADEU
      * OBJETIVO: USO DO SINAL (- E +)
      * DATA  = 07/02/2022
      ***************************************
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77  WRK-NUM1  PIC 9(02)   VALUE ZEROS.
       77  WRK-NUM2  PIC 9(02)   VALUE ZEROS.
       77  WRK-RESUL PIC S9(03)  VALUE ZEROS.
       77  WRK-RESUL-ED PIC -ZZ9 VALUE ZEROS.
       PROCEDURE DIVISION.
           ACCEPT WRK-NUM1 FROM CONSOLE.
           ACCEPT WRK-NUM2 FROM CONSOLE.
           DISPLAY '======================'
           DISPLAY 'NUMERO1.. ' WRK-NUM1.
           DISPLAY 'NUMERO2.. ' WRK-NUM2.
      *************SUBTRACAO
           SUBTRACT WRK-NUM2 FROM WRK-NUM1 GIVING WRK-RESUL.
           MOVE WRK-RESUL TO WRK-RESUL-ED.
           DISPLAY 'O RESULTADO DA SUBTRACAO E : ' WRK-RESUL.
           DISPLAY 'O RESULTADO DA SUBTRACAO E(ED): 'WRK-RESUL-ED.
           STOP RUN.
