       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB01.
      ***************************************
      * AREA DE COMENTARIOS - REMARKS
      * AUTHOR = FELIPE TADEU
      * OBJETIVO: MOSTRAR A STRING HELLO ALURA
      * DATA  = 31/01/2022
      ***************************************
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
           DISPLAY 'HELLO WORD'.
           STOP RUN.
